//Напишите программу вычисления функции:
// x = f(a)
//Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N.
//4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4" 
//2 -> " -2, -1, 0, 1, 2"

Console.Write("Укажите число > ");
string value;
value = Console.ReadLine();
int number = Convert.ToInt32(value);
int i = -number; // начало промежутка
while (i <= number)
{
    Console.Write(i+" ");
    i++;
}

